cases/Biofilm/biofilm growth/single pore/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    

    left
    {
     //type  zeroGradient;
         type            fixedValue;
     value	       uniform (0.0000000001 0 0);
    }
    
    right
    {
       type  zeroGradient;
//type            fixedValue;
  //     value	       uniform (0 0 0);
    }

    bottom
    {
//type  zeroGradient;         
 type            fixedValue;
       value	       uniform (0 0 0);
    }

    top
    {
//type  zeroGradient;          
type            fixedValue;
       value	       uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
